[
  {
    "id": 85,
    "name": "Batoul Mohamed Lotfy Gamaleldin",
    "email": "batoul.gamalaldin@gmail.com",
    "phone": "",
    "title": "Senior Research & Consumer Insight Leader / Senior Research Department Manager",
    "section": "Marketing",
    "bio": "An insight-driven and results-oriented Senior Research & Consumer Insight Leader with over 20 years of experience in market research across the Middle East and North Africa. Proven ability to translate complex data into impactful strategic recommendations, supporting brand growth and marketing optimization. Known for driving added-value insights through synthesizing multi-source research, leading and mentoring high-performing research teams, and adeptly partnering with marketing, brand, and cross-functional teams to unlock business opportunities and inform decision-making.",
    "skills": "Strategic Consumer Insights, Market Research, Multi-Methodology Analysis (Quantitative & Qualitative), Brand Health Tracking, Retail Audits, Stakeholder & Client Engagement, Team Leadership & Coaching, Regional Market Expertise (Egypt, Turkey, Iran, Sudan, North Africa), Marketing Strategy Support, Actionable Reporting, Business Storytelling, SPSS, Advanced MS Office (Excel, PowerPoint, Word, Access), Fluent in English & Arabic, Very good French",
    "experience": "Currently Senior Research Department Manager at Savola Group – SMS (Strategic Marketing Services), Egypt (since Jan 2019). Previously held roles as Research Department Manager and Senior Research Manager / Research Manager within Savola Group – SMS. Prior experience includes Research Manager / Senior Research Executive at Feedback Market Research, Egypt. Earlier roles include Marketing Research Executive at Imtenan for Trade & Exports, Marketing & Advertising Executive at Marabou Optical/Hospital, and Marketing Research Analyst at RadaResearch and PR Co.\r\n",
    "education": "Master of Psychology, Liverpool John Moores University, UK (2019 – 2023); Bachelor of Arts in Business Administration – Marketing Major, The American University in Cairo (AUC), Egypt (June 1998); Advertising Diploma – International Advertising Association (IAA), AUC (1997).\r\nCertifications & Additional Training: Certified Coach, Intellect Coaching School, Egypt (2017); French Language Diploma, Alliance Française (1992).",
    "yearsOfExperience": "20+",
    "cvFileName": null,
    "cvFilePath": "/uploads/cv-1748979721732-241938712.docx",
    "linkedinUrl": "",
    "createdAt": "2025-06-03T19:42:02.226Z",
    "updatedAt": "2025-06-03T19:42:02.226Z"
  },
  {
    "id": 84,
    "name": "Muhammad Mounir Ali",
    "email": "m.mounir@aucegypt.edu",
    "phone": "",
    "title": "Program Manager / Higher Education Specialist",
    "section": "Education / Program Management",
    "bio": "A dedicated Program Manager and Higher Education Specialist with over 12 years of progressive experience managing USAID-funded education programs at the American University in Cairo (AUC). Demonstrates success in program design, academic operations, learner support, stakeholder coordination, and implementation of Learning Management Systems (LMS). Recognized for outstanding communication, problem-solving, and leadership in diverse educational environments, with a passion for learner development, engagement strategies, and building cultures of academic excellence.",
    "skills": "Higher Education Program Management, Learning Management Systems (LMS), Moodle, Blackboard, Academic & Learner Support Services, Stakeholder & Partner Engagement, Monitoring & Evaluation (M&E), Instructor Training & Coordination, Complaint Resolution & Conflict Management, Business & Strategic Planning, Logistics & Event Management, Cross-Cultural Communication, Argos, Banner System, Microsoft Office, CCNA, C++, Reporting & Evaluation Tools, Project Management, Strategic Management, Decision Making, Customer Care, Time Management, Proctoring & Supervision",
    "experience": "Currently Program Manager for the USAID Scholars Program at The American University in Cairo (AUC). Previously Senior Program Specialist and Program Specialist in the Career Development Department and School of Continuing Education (SCE) at AUC. Earlier roles include Instructional Affairs Representative and Student Help Representative at AUC. Also held part-time/other roles as Chief Proctor for IELTS (IDP Education Ltd), Office Manager at Microhard, and an Entrepreneur (Computer Shop Owner).\r\n",
    "education": "B.Sc. in Accounting – Faculty of Commerce, Cairo University. Professional Development courses and workshops at The American University in Cairo (Project Management, Strategic Management, Decision Making, Microsoft Server 2003, CCNA, C++, Communication Skills, Customer Care, Time Management, Complaint Handling, Telephone Etiquette, Proctoring & Supervision).",
    "yearsOfExperience": "12+",
    "cvFileName": null,
    "cvFilePath": "/uploads/cv-1748979486888-340929728.docx",
    "linkedinUrl": "",
    "createdAt": "2025-06-03T19:38:07.581Z",
    "updatedAt": "2025-06-03T19:38:07.581Z"
  },
  {
    "id": 83,
    "name": "Hazem Hassanin",
    "email": "HHASSANIN72@GMAIL.COM",
    "phone": "",
    "title": "Freelancer (Strategy, OD, Culture, & Human Capital) / Consultant / CEO",
    "section": "HR",
    "bio": "A seasoned Strategy, Business Transformation, Organizational Development, Culture, and Human Capital professional with proven track records in the design and execution of strategic, operational, and administrative-level interventions. Experienced in leading projects and collaborating with top knowledge and technology houses to drive public and private organizations towards adaptability, resilience, empowerment, innovation, collaboration, and leadership development to foster agility.",
    "skills": "Strategic Leadership, Organizational Agility, Strategic Project Management, Digital Transformation, Talent Management & Development, Performance Management, Organizational Development (OD), Culture Transformation, Human Capital Strategy, Business Transformation, Growth Strategy, Customer-centric Strategies, Continuous Learning Frameworks, Innovation Culture, Kanban Project Management, Vendor Alliances, HR Technology, Agile Project Management, Shared Services Implementation, Business Process Outsourcing (BPO), Competency-based HR, Employee Retention, Compensation Structures",
    "experience": "Currently a Freelancer focusing on Strategy, OD, Culture, & Human Capital, assisting SMEs in Egypt and the Gulf. Previously Chairman & CEO of Consulting Bay Corporation (S.A.E.), CEO of Global Innovation Company (NTEC Group, Kuwait), Group HR & Admin Director at Al-Hajery Group (Kuwait), HR Manager at Al-Nazaer for Artistic Production and Distribution Co. (Kuwait), Assistant HR Manager at Daewoo Motors (Egypt), HR Officer at EGA-Mercedes Benz industrial J.V. (Egypt), and Senior Tax Auditor at Deloitte Touche Tohmatsu International – Shawky & Co. (Egypt).",
    "education": "Associate's Degree in Organizational Leadership, Certified Organizational Manager (COM), Florida State University - College of Business, USA (2015-2017); Senior Professional in Human Resources - International (SPHRi™), HR Certification Institute (HRCI), USA (2013); Associate Certified Coach (ACC), International Coaching Federation – ICF, USA (2013); Human Resource Management Diploma, The American University in Cairo, Egypt (1999-2000); Bachelor's Degree in Commerce & Business Administration, Cairo University, Faculty of Commerce, Egypt (1990-1994).",
    "yearsOfExperience": "25+",
    "cvFileName": null,
    "cvFilePath": "/uploads/cv-1748979353782-411996694.docx",
    "linkedinUrl": "",
    "createdAt": "2025-06-03T19:35:54.336Z",
    "updatedAt": "2025-06-03T19:35:54.336Z"
  },
  {
    "id": 82,
    "name": "Ghada Mahmoud Gheith",
    "email": "ghadagtheith66@gmail.com",
    "phone": "",
    "title": "Assistant Managing Director - Policies and Procedures Head / Operational Standards & Procedures Head",
    "section": "Banking / Operations / Policy & Procedures / Risk & Control",
    "bio": "A banking professional with over 30 years of diversified experience in management and leadership, including Operations, Retail Banking, Corporate Banking, ICU, and Operations Standard & Procedures. Key achievements involve establishing and heading Policies & Procedures units, leading SOP projects post-migration, reflecting CBE governance in policies, and setting up new \"Governance & Control\" and \"ICU Centralized Team\" divisions.",
    "skills": "anking Policies & Procedures Development, Operational Standards, SOP Creation & Management, Regulatory Compliance (CBE, AWB), Process Optimization, Business Process Re-Engineering, Risk Management, Governance & Control, ICU Centralized Team Management, RCA (Risk Control Assessment), Risk Evaluation, Internal Control, Corporate Banking, Retail Banking, Financial Crime, Tax Laws, Accounting Rule, Group Governance, Strategic Plan Implementation",
    "experience": "Currently Assistant Managing Director - Policies and Procedures Head at Attijariwafabank Egypt (from Dec 2021). Previously Operational Standards & Procedures Head (Business Process Re-Engineering) at Attijariwafabank Egypt (May 2017 - Dec 2021). Operational Standard & Procedure Senior Manager / Internal Control Lead / Risk and Control Manager at Barclays Bank S.A.E (June 2008 - May 2017). Deputy Manager Corporate Banking Dept. at Cairo Barclays (Aug 2004 - Mar 2006). Earlier roles at Cairo Barclays and Banque Du Caire Barclays S.A.E, dating back to January 1989, including Manager's Assistant Corporate Banking, Corporate Senior Support, and Deputy Section Head Retail & Operations.\r\n",
    "education": "Bachelor of Commerce, Cairo University, Major Accounting (Jun 88). Thanawia Amaa Port Said Language School (May 84).\r\n",
    "yearsOfExperience": "30+",
    "cvFileName": null,
    "cvFilePath": "/uploads/cv-1748978372192-901141810.pdf",
    "linkedinUrl": "",
    "createdAt": "2025-06-03T19:19:44.607Z",
    "updatedAt": "2025-06-03T19:19:44.607Z"
  },
  {
    "id": 81,
    "name": "Hany Mohamad Nabil",
    "email": "hanynabiel@hotmail.com",
    "phone": "",
    "title": "Recruitment & Admin Manager / HR & Admin Supervisor",
    "section": "HR",
    "bio": "A professional seeking a challenging position to develop technical and personal skills. Experienced in recruitment process management, administrative support (including social media, finance, web admin), job analysis, job description creation, organizational chart development, probation period evaluation, HR workflow improvement, exit interviews, and employee inquiry response.",
    "skills": "Recruitment, Administration, Job Analysis, Job Description Writing, Organizational Charts, Probation Evaluation, HR Workflow Improvement, Exit Interviews, Manpower Planning, Employee Appraisal, Training Plan Design, Internal Training Supervision, Training Effectiveness, Performance Management (HR context), Microsoft Office (Word, Excel, PowerPoint, Outlook, Labor Tracker), Internet User",
    "experience": "Currently, Recruitment & Admin Manager at Naqada Music Management (from May 2019). EL Haram Branch Manager – Outlet DPT at Aramex International CO. (Nov 2016 – May 2019). Recruitment Manager at Aras International CO – KSA (Oct 2015 – Sep 2016). HR & Admin Supervisor / HR & Admin Coordinator at Mantrac Distribution (Jan 2013 - Sep 2015 / Mar 2010 - Dec 2012). Training Center Administrator at New Horizons Computer Learning Centers (Dec 2006 - Feb 2010).\r\n",
    "education": "HR Career Certificate at the American University in Cairo (May 2014 - Mar 2015). Bachelor of Commerce, Major: Administration, The Higher Institute for Cooperative and Administrative Studies (Jun 2006).\r\n",
    "yearsOfExperience": "10+",
    "cvFileName": null,
    "cvFilePath": "/uploads/cv-1748978192010-299877659.pdf",
    "linkedinUrl": "",
    "createdAt": "2025-06-03T19:16:36.704Z",
    "updatedAt": "2025-06-03T19:16:36.704Z"
  },
  {
    "id": 80,
    "name": "Shahinaz Ahmed Abou El Naga",
    "email": "shahinaz@aucegypt.edu",
    "phone": "",
    "title": "Chief Human Capital Officer / Human Resources Director",
    "section": "HR",
    "bio": "A seasoned HR professional with overall responsibility for aligning HR support to business strategies. Experienced in compensation, bonus plans, recruitment, employee relations, coaching, performance management, rewards & recognition, HR policies, HR communication, HR tools, turnover management, people development, and payroll validation. Successfully transformed HR from a functional department to business partnering and established an HR Services Center. Maintained Top Employer Certification.",
    "skills": "HR Strategy, Business Partnering, Compensation & Benefits, Recruitment, Employee Relations, Coaching, Performance Management, Rewards & Recognition, HR Policies, HR Communication, HR Tools, Turnover Management, People Development, Payroll Validation, Job Evaluation, Top Employer Certification, Performance Management System, Succession Planning, HR Systems Management, Local Labor Law Compliance, Salary Review, HR Filing & Record Archiving, Management Training Programs, Organizational Leadership, Board Governance, Corporate Governance",
    "experience": "Currently, Chief Human Capital Officer at Strategic Education & Growth Opportunities Group (SEGO) (from June 2024). Human Resources Consultant at Brightskies (May 2023 - June 2024). Human Resources Director at Valeo Egypt (December 2015 - December 2022). Head of Egypt Human Resources Department / HR Consultant at Orange Business Services (May 2005 - July 2015). Human Resources Manager / Sr. Human Resources Specialist / Human Resources Specialist at The American University in Cairo (January 1995 - April 2005). Sr. Secretary to the Manpower Planning Manager at Glaxo Wellcome (September 1992 - December 1994).\r\n ",
    "education": "Corporate Directors Certification Program, Directors of the Institute Egyptian (Issued April 2023). Human Resources Diploma, Institute of Management Development, AUC (1997). Bachelor of Arts, Mass Communication, AUC (June 1985). Attended KPI Professional Certification Program (2018).\r\n",
    "yearsOfExperience": "20+",
    "cvFileName": null,
    "cvFilePath": "/uploads/cv-1748978073043-806857903.PDF",
    "linkedinUrl": "",
    "createdAt": "2025-06-03T19:14:34.434Z",
    "updatedAt": "2025-06-03T19:14:34.434Z"
  },
  {
    "id": 79,
    "name": "Mona Sadek El Bakry",
    "email": "monaselbakry@gmail.com",
    "phone": "",
    "title": "Chief Operations Officer / Healthcare Management Professional / Lecturer",
    "section": "Healthcare Management / Education / Operations",
    "bio": " A dedicated professional with a strong proven track record of both Practical and Academic experiences (24 year+). Aims to take a leading role in a major academic institute or healthcare organization, utilizing extensive experience to improve the organization, be on the edge of technology and success, and achieve management objectives in terms of ROI and professional image. Extensive experience in hospital operations and patient services management, as well as lecturing in healthcare and business-related subjects.",
    "skills": "Hospital Operations Management, Patient Services Management, Healthcare Administration, Strategic Planning, Performance Monitoring (KPIs), Project Management (Operational & Physical), Biomedical Department Supervision, Maintenance Management (PM & CM), CAPEX Planning, JCI Accreditation Preparation, Public Relations, Event Management, Patient Experience Program Development, Ethical Committee Participation, Safety & Occupational Health Management, Security Department Supervision, License Management, Organizational Behavior, Marketing Health Care Services, Human Resources, Supply Chain Management, Healthcare Quality (CPHQ), PMP",
    "experience": "Extensive career at Dar Al Fouad Hospital (till November 2022), holding positions from Patients' Relations Supervisor up to Chief Operations Officer. Lecturer and course developer at the American University in Cairo (January 2011 – Present) and Approved Tutor at Edinburgh Business School (United Kingdom) (January 2012 – Present).\r\n ",
    "education": "MBA, Edinburgh Business School; PMP, Project Management Institute; CPHQ, Healthcare Quality certification Commission; Certificate of Supply Chain Management (SCM), American University in Cairo; Healthcare & Hospital Management Post-Graduate Diploma, American University in Cairo; Certified Director – Corporate Directors Certification Program, Egyptian Institute of Directors EIOD; Bachelor of Arts, English Literature Department, Faculty of Arts, Cairo University. Currently a PhD Student in the Management of Technology Department (MOT) at Nile University.",
    "yearsOfExperience": "24+",
    "cvFileName": null,
    "cvFilePath": "/uploads/cv-1748977926554-633708140.pdf",
    "linkedinUrl": "",
    "createdAt": "2025-06-03T19:12:09.796Z",
    "updatedAt": "2025-06-03T19:12:09.796Z"
  },
  {
    "id": 78,
    "name": "Mohamed Atef Mousa",
    "email": "mohamedatefmousa@outlook.com",
    "phone": "",
    "title": "Finance Manager / Financial Services Consultant",
    "section": "Finance",
    "bio": "A finance professional with over nineteen years of solid accounting and ERP (SAP, Oracle, QuickBooks, Odoo) experience. Extensive experience in compiling and analyzing financial reports, establishing accounting control procedures, and developing financial management strategies. Strong IT skills in various accounting applications, with a background in auditing, taxation, budgeting, people management, and in-depth knowledge of legislative requirements. Currently Finance Manager at a Health Insurance and TPA Company, and also works as a self-employed Financial Services Consultant.",
    "skills": "Financial Planning & Analysis, Budgeting, Financial Forecasting, Variance Analysis, KPI Tracking, Financial Modeling, Accounting Cycle Management, Financial Reporting (Monthly, Quarterly, Annual), Statutory Filings, Tax Returns, Audit Process Management, Internal Controls, Risk Management (Credit, Market, Operational), Cash Flow Management, Working Capital Management, Banking Relationships, Treasury Functions, Insurance Accounting, Premium Accounting, Claims Processing, Reserves, Team Management, Mentoring, SAP, Oracle, QuickBooks, Odoo, MS Office, Net Suite, Peachtree, Louts Notes, Gmail, Sox testing, Workflow Project Management, AP Management, AIM Project Management",
    "experience": " Currently Finance Manager at Health Insurance and TPA Company (from Aug 2024). Self-employed Financial Services Consultant (from Jan 2023). Previously Investment Manager at a Holding Company, UAE (Hybrid, Jan 2023 - Jan 2025). Finance Manager at Leasing & Advisors Company, Egypt (Feb 2020 - Aug 2024). Head of Financial Accounting at Medical Insurance Company, Egypt (Mar 2013 - Jan 2022). Senior Business Analyst/Verticent Accounting Expert at Egytrafo (Aug 2012 - Mar 2013). Various roles at ABB Egypt, including Sox testing manager, OF Assessor, Scanning & Workflow Project Manager, AIM Project Manager, AP Senior Specialist Accountant, Accounting Center Team Lead, and Senior Accountant (Jun 2003 - Aug 2012).",
    "education": "Bachelor's in Commercial Science, Cairo University (1999-2003). CMA study Part 1 (EY Egypt).\r\n",
    "yearsOfExperience": "19+",
    "cvFileName": null,
    "cvFilePath": "/uploads/cv-1748977786727-770016849.pdf",
    "linkedinUrl": "",
    "createdAt": "2025-06-03T19:09:49.965Z",
    "updatedAt": "2025-06-03T19:09:49.965Z"
  },
  {
    "id": 77,
    "name": "Mahmoud Elmaghraby",
    "email": "Mahmoud.elmaghraby11@gmail.com",
    "phone": "",
    "title": "Software Engineer",
    "section": "Technology/IT",
    "bio": " A highly motivated and passionate Software Engineer with a strong focus on delivering innovative and impactful, user-focused solutions. Experienced in frontend development (React.js, React Native, TypeScript/JavaScript), RESTful API integration, reusable component creation, state management (Redux Toolkit, Context API), and version control (Git). Also has freelancing experience in developing responsive web applications with ReactJS, NextJS, and TypeScript, leveraging SEO and performance optimization.",
    "skills": "React.js, React Native, TypeScript, JavaScript, RESTful APIs, Redux Toolkit, Context API, Git, HTML5, CSS3, Angular, SASS, Bootstrap, TailwindCSS, Firebase, NodeJS, ExpressJS, MongoDB, C++, Java, Dart, NPM, OOP, SOLID, Data Structures, Algorithms, Problem Solving, Agile methodologies, Teamworking, Mentorship, Communication Skills",
    "experience": " Frontend Software Engineer at Netway Corp (from February 2025). Software Engineer [Freelancing] (November 2023 – January 2025).\r\n ",
    "education": "Bachelor's of Management Sciences (Major: Business Information Systems), Sadat Academy for Management Sciences (Sept 2018 – July 2022, Cumulative Grade: Good). Intensive Training Program – Information Technology Institute (ITI), Ministry of Communications and Information Technology (MCIT), Frontend and Cross-platform Mobile Development track (May 2024 – October 2024).",
    "yearsOfExperience": "1+",
    "cvFileName": null,
    "cvFilePath": "/uploads/cv-1748977606058-295843595.pdf",
    "linkedinUrl": "https://linkedin.com/in/Maghrabyy",
    "createdAt": "2025-06-03T19:06:49.594Z",
    "updatedAt": "2025-06-03T19:06:49.594Z"
  },
  {
    "id": 76,
    "name": "Salma Youssef Mohamed",
    "email": "Sa.yousef89@yahoo.com",
    "phone": "",
    "title": "Talent Acquisition / HR Specialist",
    "section": "HR",
    "bio": " Human Resources professional specializing in Talent Acquisition, seeking new opportunities to gain experience and develop skills. Experienced in coordinating with hiring managers, designing job descriptions, sourcing candidates (online & offline), conducting interviews and selection procedures, assessing candidate information, forecasting hiring needs, and managing recruitment events and candidate tracking systems.",
    "skills": "Talent Acquisition, Recruitment, Hiring Management, Job Description Design, Candidate Sourcing, Interviewing, Selection Process, Candidate Assessment, Hiring Forecast, Job Fairs, Candidate Tracking, Hiring Metrics, Job Offers, Onboarding Coordination, Manpower Reporting, Administrative Services, Social Media (for recruitment), Headhunting, Staff Performance Monitoring, Policy Implementation",
    "experience": "Currently SR. Talent Acquisition at Travco Company (from Jan 2024). SR. Talent Acquisition at Kazyon Company (Sep 2022 — Nov 2023). Office Manager & HR Specialist at Blue Rock (Apr 2021 – Sep 2021). HR Recruitment Specialist at Andalusia group (Dec 2019 – July 2020). HR & Administration at BAT Company (Mar 2017 – Mar 2019). HR & Administration at Sun Pharma (Jan 2016 - Dec 2016). Medical Representative at RoVamed Pharma (Apr 2013 - Oct 2015). Customer Services at Vodafone UK (Mar 2012 - Mar 2013). Tele Marketing at Vodafone (Feb 2011 - Feb 2012).\r\n",
    "education": "Principles of Human Resources and Advanced Training-Diploma (2015). Bachelor of Social Service at the Higher Institute of Social Work (2010).",
    "yearsOfExperience": "5+",
    "cvFileName": null,
    "cvFilePath": "/uploads/cv-1748977479856-56748784.pdf",
    "linkedinUrl": "",
    "createdAt": "2025-06-03T19:04:40.880Z",
    "updatedAt": "2025-06-03T19:04:40.880Z"
  },
  {
    "id": 75,
    "name": "Habiba Kamel",
    "email": "habibakamel2001@gmail.com",
    "phone": "",
    "title": "Digital Marketing Professional / Aspiring Marketing Graduate",
    "section": "Marketing",
    "bio": "An aspiring graduate with a strong interest in marketing, eager to apply academic knowledge in market analysis, consumer behavior, and campaign management. Possesses excellent communication skills and a proactive mindset, ready to adapt and thrive in fast-paced marketing environments. Experience in digital marketing, content creation, and various finance-related internships.",
    "skills": "Digital Marketing, Social Media Campaigns, Content Creation, Performance Metrics, Event Logistics, Vendor Coordination, Press Releases, Company Analysis, ECM Updates, DCF Valuations, Brokerage Tasks, Client Financial Planning, Market Insights, Marketing Copywriting, Trend Tracking, Consumer Data Analysis, SAP (A/R), Logical and Systematic Thinking, Leadership Thinking, Relationship Building, Financial Data Analysis, Problem-solving, Communication Skills, Mimic social (Stukent Marketing Certified), Google Analytics (Fundamentals of Digital Marketing) certified, Digital Advertising certified, Social Media Marketing certified",
    "experience": "Upcoming role in Digital Marketing at NEWGIZA Sports Club (from Feb 2025). Content Creation and Account Management at Momentum (Sept 2024 - Jan 2025). Internship experiences at Influence Communications, EFG Holding, Pioneer Securities, NATCO (SNA), and Finance Internship – A/R.\r\n",
    "education": "Bachelor of Business Administration, ESLSCA University, Cairo (Double major in finance and sports management, 2020-2024). El Alsson British and American International School (American Diploma Graduate, 2005-2020).\r\n",
    "yearsOfExperience": "1+",
    "cvFileName": null,
    "cvFilePath": "/uploads/cv-1748977217721-711799134.pdf",
    "linkedinUrl": "https://www.linkedin.com/in/habiba-kamel-282953223",
    "createdAt": "2025-06-03T19:00:18.553Z",
    "updatedAt": "2025-06-03T19:00:18.553Z"
  },
  {
    "id": 74,
    "name": "Habiba Kamel",
    "email": "habibakamel2001@gmail.com",
    "phone": "",
    "title": "Digital Marketing Professional / Aspiring Marketing Graduate",
    "section": "Marketing",
    "bio": "An aspiring graduate with a strong interest in marketing, eager to apply academic knowledge in market analysis, consumer behavior, and campaign management. Possesses excellent communication skills and a proactive mindset, ready to adapt and thrive in fast-paced marketing environments. Experience in digital marketing, content creation, and various finance-related internships.",
    "skills": "Digital Marketing, Social Media Campaigns, Content Creation, Performance Metrics, Event Logistics, Vendor Coordination, Press Releases, Company Analysis, ECM Updates, DCF Valuations, Brokerage Tasks, Client Financial Planning, Market Insights, Marketing Copywriting, Trend Tracking, Consumer Data Analysis, SAP (A/R), Logical and Systematic Thinking, Leadership Thinking, Relationship Building, Financial Data Analysis, Problem-solving, Communication Skills, Mimic social (Stukent Marketing Certified), Google Analytics (Fundamentals of Digital Marketing) certified, Digital Advertising certified, Social Media Marketing certified",
    "experience": "Upcoming role in Digital Marketing at NEWGIZA Sports Club (from Feb 2025). Content Creation and Account Management at Momentum (Sept 2024 - Jan 2025). Internship experiences at Influence Communications, EFG Holding, Pioneer Securities, NATCO (SNA), and Finance Internship – A/R.\r\n",
    "education": "Bachelor of Business Administration, ESLSCA University, Cairo (Double major in finance and sports management, 2020-2024). El Alsson British and American International School (American Diploma Graduate, 2005-2020).\r\n",
    "yearsOfExperience": "1+",
    "cvFileName": null,
    "cvFilePath": "/uploads/cv-1748977214174-960081729.pdf",
    "linkedinUrl": "https://www.linkedin.com/in/habiba-kamel-282953223",
    "createdAt": "2025-06-03T19:00:17.542Z",
    "updatedAt": "2025-06-03T19:00:17.542Z"
  },
  {
    "id": 73,
    "name": "Heba Talaat",
    "email": "htalaat@hotmail.com",
    "phone": "",
    "title": "enior Regional Office Manager to the Executive Director / HR & Soft Skills Instructor",
    "section": "HR",
    "bio": "A professional with over 20 years of extensive experience in core significant Administration and HR functions within Telecommunication, IT industries, diplomatic status institutes, and non-profit organizations. Also worked as an Instructor for HR & Soft Skills courses. Currently supporting an Executive Director by managing office operations and ensuring alignment with organizational goals.",
    "skills": "Office Management, Executive Support, Stakeholder Liaison, Calendar Management, Travel Arrangements, Correspondence Handling, Meeting Coordination, Report Preparation, Confidential Information Handling, Filing Systems (Hardcopy & Electronic), Record Management, Workshop Participation, Information Flow Facilitation, Problem Solving, HR Coordination, Hiring Process, Resigning Process, Contract Preparation, Employee Documentation, Attendance System Management, Leave Process, Medical Insurance Management, Recruitment Life Cycle, Cafeteria Management, Marketing Campaign Assistance, Exhibition Process, Staff Training, Skills Profile Development, MS Word, MS Excel, MS PowerPoint, MS Outlook, Access Course, Touch Typing (English/Arabic)",
    "experience": " Currently Senior Regional Office Manager to the Executive Director at Centre for Environment & Development for Arab Region and Europe (CEDARE) since November 2010. Previously Executive Assistant to the Executive Director at The Egyptian Center for Economic Studies (ECES). Part-Time Instructor at School of Continuing Education – SCE, American University in Cairo, Cairo University & others. Office Manager for GM & DGM / Office Manager & HR Coordinator at Egypt Call for Communications. Executive Secretary/Marketing Assistant at Nile Soft International. Senior Secretary at RAMW for Tourism and Hotels. Secretary at American Express for Tourism.\r\n ",
    "education": "Bachelor of Commerce, Business Administration, Ain Shams University (1984). Lycée La Liberté Héliopolis. Certifications in Training of Trainers, Human Resources Management, and Management from AUC.",
    "yearsOfExperience": "20+",
    "cvFileName": null,
    "cvFilePath": "/uploads/cv-1748977071818-670694707.pdf",
    "linkedinUrl": "",
    "createdAt": "2025-06-03T18:57:54.481Z",
    "updatedAt": "2025-06-03T18:57:54.481Z"
  },
  {
    "id": 72,
    "name": "Heba Talaat",
    "email": "htalaat@hotmail.com",
    "phone": "",
    "title": "enior Regional Office Manager to the Executive Director / HR & Soft Skills Instructor",
    "section": "HR",
    "bio": "A professional with over 20 years of extensive experience in core significant Administration and HR functions within Telecommunication, IT industries, diplomatic status institutes, and non-profit organizations. Also worked as an Instructor for HR & Soft Skills courses. Currently supporting an Executive Director by managing office operations and ensuring alignment with organizational goals.",
    "skills": "Office Management, Executive Support, Stakeholder Liaison, Calendar Management, Travel Arrangements, Correspondence Handling, Meeting Coordination, Report Preparation, Confidential Information Handling, Filing Systems (Hardcopy & Electronic), Record Management, Workshop Participation, Information Flow Facilitation, Problem Solving, HR Coordination, Hiring Process, Resigning Process, Contract Preparation, Employee Documentation, Attendance System Management, Leave Process, Medical Insurance Management, Recruitment Life Cycle, Cafeteria Management, Marketing Campaign Assistance, Exhibition Process, Staff Training, Skills Profile Development, MS Word, MS Excel, MS PowerPoint, MS Outlook, Access Course, Touch Typing (English/Arabic)",
    "experience": " Currently Senior Regional Office Manager to the Executive Director at Centre for Environment & Development for Arab Region and Europe (CEDARE) since November 2010. Previously Executive Assistant to the Executive Director at The Egyptian Center for Economic Studies (ECES). Part-Time Instructor at School of Continuing Education – SCE, American University in Cairo, Cairo University & others. Office Manager for GM & DGM / Office Manager & HR Coordinator at Egypt Call for Communications. Executive Secretary/Marketing Assistant at Nile Soft International. Senior Secretary at RAMW for Tourism and Hotels. Secretary at American Express for Tourism.\r\n ",
    "education": "Bachelor of Commerce, Business Administration, Ain Shams University (1984). Lycée La Liberté Héliopolis. Certifications in Training of Trainers, Human Resources Management, and Management from AUC.",
    "yearsOfExperience": "20+",
    "cvFileName": null,
    "cvFilePath": "/uploads/cv-1748977069509-109337227.pdf",
    "linkedinUrl": "",
    "createdAt": "2025-06-03T18:57:52.583Z",
    "updatedAt": "2025-06-03T18:57:52.583Z"
  },
  {
    "id": 71,
    "name": "Sama Tarek ElFergani",
    "email": "sama.elfergani175@gmail.com",
    "phone": "",
    "title": "CRM Specialist / Digital Marketing Specialist",
    "section": "Marketing",
    "bio": "A marketing professional with upcoming and current experience as a CRM Specialist at Waffarha and a Digital Marketing Specialist (Performance Marketing) at Digi-tell Advertising Agency. Experience includes customer engagement, marketing automation (MoEngage), link tracking (Bitly, Firebase), campaign creation (email, push, SMS), user flow design, performance metrics analysis, customer journey mapping, content creation, localization, data analysis, media buying (Tiktok, Snapchat, Meta, Apple search, Google ads). Also interned in marketing and communications at Banque Misr and digital marketing at Gameball.",
    "skills": " MoEngage, Bitly, Firebase, Email Campaigns, App Push Notifications, In-app Messaging, SMS Marketing, User Flow Design, Performance Metrics, Customer Journey Mapping, Content Creation, Localization (English, Kuwaiti Arabic, Saudi Arabic), Data Analysis, Media Buying (Tiktok ads, Snapchat ads, Meta ads, Apple search, Google ads), Social Media Planning, SEO, Case Studies, MS Office Excel, Word, PowerPoint, SemRush (Beginner), Canva, Asanna, Flowchart",
    "experience": "CRM Specialist at Waffarha (from Jan 2025). Digital Marketing Specialist (Performance Marketing) at Digi-tell Advertising agency (Aug 2024 - Dec 2024). Marketing and Communications Intern at Banque Misr (Feb 2024 - June 2024). Digital Marketing Intern at Gameball (Aug 2023 - Sep 2023).\r\n \r\n",
    "education": "German International University (2020-2024), Business Administration, Major: Digital Marketing, Minor: International Business (GPA: Very Good). IGCSE (2017-2020).",
    "yearsOfExperience": "1+",
    "cvFileName": null,
    "cvFilePath": "/uploads/cv-1748976941143-300776398.pdf",
    "linkedinUrl": "www.linkedin.com/in/samatarek1234",
    "createdAt": "2025-06-03T18:55:41.569Z",
    "updatedAt": "2025-06-03T18:55:41.569Z"
  },
  {
    "id": 70,
    "name": "Ziad Ibrahim",
    "email": "ZiadTantawy9@gmail.com",
    "phone": "",
    "title": "Software Engineering Intern / Computer Science Student",
    "section": "Technology/IT",
    "bio": "A third-year Computer Science & Engineering student with internship experience at ITWorx and ElSewedy Electric, focusing on full-stack development, CRUD app creation, and IoT applications. Proficient in multiple programming languages and frameworks, with a strong interest in web development and machine learning.",
    "skills": "Python, Java, JavaScript (ES5, ES6), TypeScript, HTML/CSS, C#, C, SQL, Haskell, Prolog, VHDL, ReactJS, Redux, Tailwind CSS, Bootstrap, NodeJS, ExpressJS, FastAPI, MongoDB, PostgreSQL, MS SQL Server, Pandas, Numpy, Matplotlib, Seaborn, Scikit-learn, Keras, TensorFlow, Pytorch, Git, npm, Vite, Postman, OOP, CRUD, API Optimization, IoT, Cybersecurity (awareness)",
    "experience": "Software Engineering Intern at ITWorx (managed a team and developed a full-stack app with React, Python, FastAPI, and PostgreSQL). Software Engineering Intern at ElSewedy Electric (built a CRUD app with C#, Entity Framework, SQL Server). I participated in the Cisco Summer Orientation program (explored IoT, shadowed a Cybersecurity Architect).\r\n",
    "education": "German University in Cairo, Undergraduate Third Year Student, Faculty of Media Engineering & Technology (MET), Department of Computer Science & Engineering (2022-2027). Egypt British International School (EBIS), High School Diploma-IGCSE (2019-2022).\r\n",
    "yearsOfExperience": "1+",
    "cvFileName": null,
    "cvFilePath": "/uploads/cv-1748976812884-460715956.pdf",
    "linkedinUrl": "",
    "createdAt": "2025-06-03T18:53:33.918Z",
    "updatedAt": "2025-06-03T18:53:33.918Z"
  },
  {
    "id": 69,
    "name": "Hend Shafeek Hassan Damaty",
    "email": "Notexplicitly@gmail.com",
    "phone": "",
    "title": "Not specified",
    "section": "Technology/IT",
    "bio": "Seeking a challenging position that provides opportunities for further experiences to assume greater responsibility and improve skills.",
    "skills": " Excel, Word, PowerPoint, Outlook, ICDL, Internet User, Communication Skills, Team Member, Arabic (Native), English (Good), French (Good)",
    "experience": "Not specified",
    "education": "High Institute for Computer Science and Information Systems (Year of Graduation: 2006).",
    "yearsOfExperience": "Not specified ",
    "cvFileName": null,
    "cvFilePath": "/uploads/cv-1748976499334-459970139.pdf",
    "linkedinUrl": "",
    "createdAt": "2025-06-03T18:48:19.869Z",
    "updatedAt": "2025-06-03T18:48:19.869Z"
  },
  {
    "id": 64,
    "name": "Hagar Walid",
    "email": "hagaratif9@gmail.com",
    "phone": "01094047268",
    "title": "Professional",
    "section": "Consulting",
    "bio": "No information provided yet",
    "skills": "To be updated",
    "experience": "To be updated",
    "education": "",
    "yearsOfExperience": "",
    "cvFileName": null,
    "cvFilePath": "/uploads/cv-1748969690173-579852015.pdf",
    "linkedinUrl": "",
    "createdAt": "2025-06-02T18:37:59.194Z",
    "updatedAt": "2025-06-03T16:54:52.306Z"
  },
  {
    "id": 63,
    "name": "Salma Abousenna",
    "email": "Salma.abousenna@aucegypt.edu",
    "phone": "",
    "title": "Head of Operations and assistant to CEO",
    "section": "Education",
    "bio": "Ex-HEAD of Operations and assistant to CEO",
    "skills": "Diplomacy; Teaching English; Translation.",
    "experience": "Experience details to be updated",
    "education": "",
    "yearsOfExperience": "10+",
    "cvFileName": null,
    "cvFilePath": "/uploads/cv-1748969741392-707895541.pdf",
    "linkedinUrl": "https://www.linkedin.com/in/salmaabousenna/",
    "createdAt": "2025-06-02T05:18:39.058Z",
    "updatedAt": "2025-06-03T16:55:41.735Z"
  },
  {
    "id": 67,
    "name": "Amr Kamel",
    "email": "amr.kamel@newgiza.com",
    "phone": "",
    "title": "Marketing Professional",
    "section": "Marketing",
    "bio": "Marketing professional with diverse experience",
    "skills": "Marketing Strategy, Digital Marketing, Brand Management",
    "experience": "Professional marketing experience",
    "education": "",
    "yearsOfExperience": "",
    "cvFileName": null,
    "cvFilePath": null,
    "linkedinUrl": "",
    "createdAt": "2025-06-01T12:00:00.000Z",
    "updatedAt": "2025-06-01T12:00:00.000Z"
  },
  {
    "id": 66,
    "name": "Basma Nazif",
    "email": "basmanazif@gmail.com",
    "phone": "01003716331",
    "title": "Program Manager",
    "section": "Consulting",
    "bio": "Experienced program manager with expertise in consulting services",
    "skills": "Program Management, Strategic Planning, Project Coordination",
    "experience": "Professional experience in program management and consulting",
    "education": "",
    "yearsOfExperience": "",
    "cvFileName": null,
    "cvFilePath": null,
    "linkedinUrl": "",
    "createdAt": "2025-06-01T11:00:00.000Z",
    "updatedAt": "2025-06-01T11:00:00.000Z"
  },
  {
    "id": 65,
    "name": "Amna El-Tayeb",
    "email": "amnaeltayeb16@hotmail.com",
    "phone": "01067880372",
    "title": "UN Volunteer - Project Assistant",
    "section": "Consulting",
    "bio": "Professional with experience in UN volunteer work and project assistance",
    "skills": "Project Management, Administrative Support, International Development",
    "experience": "Experience in consulting and project assistance roles",
    "education": "",
    "yearsOfExperience": "",
    "cvFileName": null,
    "cvFilePath": "/uploads/cv-1748969755854-62075756.pdf",
    "linkedinUrl": "",
    "createdAt": "2025-06-01T10:00:00.000Z",
    "updatedAt": "2025-06-03T16:55:56.604Z"
  }
]